; domain
(define 
	(domain kupiec)
	(:requirements :adl)
	(:predicates
		(wieksze ?x ?y)
		(ilosc ?typ ?licznosc)
		(wozek ?co ?pozycja)
		(pomocnik-z-kupcem ?numer)
		(sasiaduje ?x ?y)
		(rzad ?x ?y)
		(pole ?x)
		(kupiec ?x)
		(przyprawy ?x)
		(tkanina ?x)
		(owoce ?x)
		(palac ?x)
		(fontanna ?x)
		(targowisko ?x)
		(czarny-rynek ?x)
		(pomocnik ?pole ?nr)
		(pom ?x)
	)
	
	(:action u-sultana
    	:precondition
    	(and
    	    (kupiec ps)
    	    (wozek kawa n1)
    	    (wozek kawa n2)

    	    (exists (?x) (wozek przyprawa ?x))
    	    (exists (?x) (wozek owoce ?x))
    	    (exists (?x) (wozek tkanina ?x))
    	)
    	:effect
    	(and
    	    (wozek rubin n1)
    	)
	)
	
	(:action idz-do-f 
		:parameters(?skad ?dokad ?pompol1 ?pompol2)
		:precondition
		(and
			(kupiec ?skad)
			(not(= ?skad ?dokad))
			(= ?dokad f)
			(pole ?pompol1)
			(pole ?pompol2)
			(pomocnik ?pompol1 p1)
			(pomocnik ?pompol2 p2)
		)
		:effect
		(and
			(not(kupiec ?skad))
			(kupiec ?dokad)
			(pomocnik-z-kupcem p1)
			(pomocnik-z-kupcem p2)
			(not(pomocnik ?pompol1 p1))
			(not(pomocnik ?pompol2 p2))
		)
	)
	
	(:action idz-jeden-pomocnik
		:parameters(?skad ?dokad ?pom)
		:precondition
		(and
			(kupiec ?skad)
			(not(= ?skad ?dokad))
			(sasiaduje ?skad ?dokad)
			(pomocnik ?dokad ?pom)
			(pom ?pom)
		)
		:effect
		(and
			(not (kupiec ?skad))
			(kupiec ?dokad)
			(pomocnik-z-kupcem ?pom)
			(not(pomocnik ?dokad ?pom))
		)
	)
	
	(:action idz-jeden-brak-pomocnika
		:parameters (?skad ?dokad ?pom)
		:precondition
		(and 
			(kupiec ?skad)
			(not(= ?skad ?dokad))
			(sasiaduje ?skad ?dokad)
			(not(exists (?x) (pomocnik ?dokad ?x)))
			(pomocnik-z-kupcem ?pom)
			(pom ?pom)
		)
		:effect
		(and
			(kupiec f)
			(not(kupiec ?skad))
			(when
				(not(= ?dokad f))
				(and (pomocnik ?dokad ?pom) (not(pomocnik-z-kupcem ?pom)))
			)
		)
	)
	
	(:action idz-dwa-pomocnik
		:parameters (?skad ?dokad ?pom)
		:precondition
		(and
			(kupiec ?skad)
			(not (= ?skad ?dokad))
			(rzad ?skad ?dokad)
			(pomocnik ?dokad ?pom)
			(pom ?pom)
		)
		:effect
		(and
			(not(kupiec ?skad))
			(kupiec ?dokad)
			(pomocnik-z-kupcem ?pom)
			(not(pomocnik ?dokad ?pom))
		)
	)
	
	(:action idz-dwa-brak-pomocnik
		:parameters (?skad ?dokad ?pom)
		:precondition
		(and
			(kupiec ?skad)
			(not(=?skad ?dokad))
			(rzad ?skad ?dokad)
			(not(exists (?x) (pomocnik ?dokad ?x)))
			(pomocnik-z-kupcem ?pom)
			(pom ?pom)
		)
		:effect
		(and
			(not(kupiec ?skad))
			(kupiec ?dokad)
			(when
				(not(= ?dokad f))
				(and (pomocnik ?dokad ?pom) (not (pomocnik-z-kupcem ?pom)))
			)
		)
	)
	
	(:action wez-przyprawy
		:parameters (?ilosc)
		:precondition
		(and
			(kupiec sp)
			(ilosc przyprawa ?ilosc)
			(wieksze n3 ?ilosc)
		)
		:effect
		(and
			(when
				(= ?ilosc n0)
				(and (not(ilosc przyprawa ?ilosc)) (ilosc przyprawa n3) (wozek przyprawa n1)
				(wozek przyprawa n2) (wozek przyprawa n3))
			)
			(when
				(= ?ilosc n1)
				(and (not (ilosc przyprawa ?ilosc)) (ilosc przyprawa n2) (wozek przyprawa n1))
			)
			(when
				(= ?ilosc n2)
				(and (not (ilosc przyprawa ?ilosc)) (ilosc przyprawa n3) (wozek przyprawa n3))
			)
		)
	)
	
	(:action wez-czarny-rynek
		:parameters (?iloscP ?iloscO ?iloscT)
		:precondition
		(and
			(kupiec cr)
			(ilosc przyprawa ?iloscP)
			(wieksze ?iloscP n3)
			(ilosc owoce ?iloscO)
			(wieksze ?iloscO n3)
			(ilosc tkanina ?iloscT)
			(wieksze ?iloscT n3)
		)
		:effect
		(and
			
    		(when 
        		(= ?iloscP n0) 
        		(and (not (ilosc przyprawa ?iloscP)) (ilosc przyprawa n1) (wozek przyprawa n1))
        	)
        	(when 
        		(= ?iloscP n1) 
        		(and (not (ilosc przyprawa ?iloscP)) (ilosc przyprawa n2) (wozek przyprawa n2))
        	)
        	(when 
        		(= ?iloscP n2) 
        		(and (not (ilosc przyprawa ?iloscP)) (ilosc przyprawa n3) (wozek przyprawa n3))
        	)
        	(when 
        		(= ?iloscO n0) 
        		(and (not (ilosc owoce ?iloscO)) (ilosc owoce n1) (wozek owoce n1))
        	)
        	(when 
        		(= ?iloscO n1) 
        		(and (not (ilosc owoce ?iloscO)) (ilosc owoce n2) (wozek owoce n2))
        	)
        	(when 
        		(= ?iloscO n2) 
        		(and (not (ilosc owoce ?iloscO)) (ilosc owoce n3) (wozek owoce n3))
        	)
        	(when 
        		(= ?iloscT n0) 
        		(and (not (ilosc tkanina ?iloscT)) (ilosc tkanina n1) (wozek tkanina n1))
        	)
        	(when 
        		(= ?iloscT n1) 
        		(and (not (ilosc tkanina ?iloscT)) (ilosc tkanina n2) (wozek tkanina n2))
        	)
        	(when 
        		(= ?iloscT n2) 
        		(and (not (ilosc tkanina ?iloscT)) (ilosc tkanina n3) (wozek tkanina n3))
        	)
		)
	)
	
	(:action wez-owoc
		:parameters(?ilosc)
		:precondition
		(and
			(kupiec so)
			(ilosc owoce ?ilosc)
			(wieksze ?ilosc n3)
		)
		:effect
		(and
			(when
				(= ?ilosc n0)
				(and (not(ilosc owoce ?ilosc)) (ilosc owoce n3) (wozek owoce n1)
				(wozek owoce n2) (wozek owoce n3))
			)
			(when
				(= ?ilosc n1)
				(and (not (ilosc owoce ?ilosc)) (ilosc owoce n2) (wozek owoce n1))
			)
			(when
				(= ?ilosc n2)
				(and (not (ilosc owoce ?ilosc)) (ilosc owoce n3) (wozek owoce n3))
			)
		)
	)
	
	(:action wez-tkanina
    	:parameters (?ilosc)
    	:precondition
    	(and
    	    (kupiec so)
    	    (ilosc tkanina ?ilosc)
    	    (wieksze ?ilosc n3)
    	)
    	:effect
    	(and
    		(when 
        		(= ?ilosc n0) 
        		(and (not (ilosc tkanina ?ilosc)) (ilosc tkanina n3) (wozek tkanina n1) (wozek tkanina n2) 
        		(wozek tkanina n3) )
        	)
        	(when 
        		(= ?ilosc n1) 
        		(and (not (ilosc tkanina ?ilosc)) (ilosc tkanina n3) (wozek tkanina n2)  (wozek tkanina n3))
        	)
        	(when 
        		(= ?ilosc n2) 
        		(and (not (ilosc tkanina ?ilosc)) (ilosc tkanina n3) (wozek tkanina n3))
        	)
    	)
	)
	
	(:action sprzedaj-przyprawa
		:parameters (?ilosc)
		:precondition
		(and
			(kupiec t)
			(wozek przyprawa n1)
			(wozek przyprawa n2)
			(wozek przyprawa n3)
			(ilosc kawa ?ilosc)
		)
		:effect
		(and
			(not (wozek przyprawa n1))
    	    (not (wozek przyprawa n2))
    	    (not (wozek przyprawa n3))
    	    (not (ilosc przyprawa n3))
    	    (ilosc przyprawa n0)
    	    (when 
        		(= ?ilosc n0) 
        		(and (not (ilosc kawa ?ilosc)) (ilosc kawa n1) (wozek kawa n2))
        	)
        	(when 
        		(= ?ilosc n1) 
        		(and (not (ilosc kawa ?ilosc)) (ilosc kawa n2) (wozek kawa n2))
        	)
		)
	)
		
	(:action sprzedaj-tkanina
    	:parameters (?ilosc)
    	:precondition
    	(and
    	    (kupiec t)
    	    (wozek tkanina n1)
    	    (wozek tkanina n2)
    	    (wozek tkanina n3)
    	    (ilosc kawa ?ilosc)
    	)
    	:effect
    	(and
    	    (not (wozek tkanina n1))
    	    (not (wozek tkanina n2))
    	    (not (wozek tkanina n3))
    	    (not (ilosc tkanina n3))
    	    (ilosc tkanina n0)
    	    (when 
        		(= ?ilosc n0) 
        		(and (not (ilosc kawa ?ilosc)) (ilosc kawa n1) (wozek kawa n1))
        	)
        	(when 
        		(= ?ilosc n1) 
        		(and (not (ilosc kawa ?ilosc)) (ilosc kawa n2) (wozek kawa n2))
        	)
    	)
    	)
    	
    	(:action sprzedaj-owoce
    	:parameters (?ilosc)
    	:precondition
    	(and
    	    (kupiec t)
    	    (wozek owoce n1)
    	    (wozek owoce n2)
    	    (wozek owoce n3)
    	    (ilosc kawa ?ilosc)
    	)
    	:effect
    	(and
    	    (not (wozek owoce n1))
    	    (not (wozek owoce n2))
    	    (not (wozek owoce n3))
    	    (not (ilosc owoce n3))
    	    (ilosc owoce n0)
    	    (when 
        		(= ?ilosc n0) 
        		(and (not (ilosc kawa ?ilosc)) (ilosc kawa n1) (wozek kawa n1))
        	)
        	(when 
        		(= ?ilosc n1) 
        		(and (not (ilosc kawa ?ilosc)) (ilosc kawa n2) (wozek kawa n2))
        	)
    	)
	)
	
	
	
)

; problem
(define (problem kupiec)
	(:domain kupiec)
	(:objects
		n0 n1 n2 n3 kawa tkanina przyprawa owoce rubin
		p1 p2
		cr sp t f ps st so
	)
	(:init
		(wieksze n2 n3)
		(wieksze n1 n3)
		(wieksze n0 n3)
		(wieksze n1 n2)
		(wieksze n0 n2)
		(wieksze n0 n1)
		(pom p1)
		(pom p2)
		
		(ilosc kawa n0)
		(ilosc tkanina n0)
		(ilosc przyprawa n0)
		(ilosc owoce n2)
		(ilosc rubin n0)
		
		(wozek owoce n1)
		(wozek owoce n2)
		
		(pomocnik-z-kupcem p1)
		(pomocnik-z-kupcem p2)
		
		(sasiaduje cr sp)
		(sasiaduje sp cr)
		(sasiaduje sp t)
		(sasiaduje t sp)
		(sasiaduje sp f)
		(sasiaduje f sp)
		(sasiaduje f st)
		(sasiaduje st f)
		(sasiaduje st ps)
		(sasiaduje ps st)
		(sasiaduje so st)
		(sasiaduje st so)
		
		(rzad cr t)
		(rzad t cr)
		(rzad sp st)
		(rzad st sp)
		(rzad ps so)
		(rzad so ps)
		
		(pole cr)
		(pole sp)
		(pole t)
		(pole f)
		(pole ps)
		(pole st)
		(pole so)
		
		(kupiec f)
		
		(przyprawy sp)
		(owoce so)
		(tkanina st)
		(czarny-rynek cr)
		(targowisko t)
		(fontanna f)
		(palac ps)
		
	)
	(:goal
		(and
			(kupiec ps)
			(wozek rubin n1)
		)
	)

)

; plan
1. (idz-jeden-brak-pomocnika f sp p1)
   deleted: (pomocnik-z-kupcem p1)
   added: (pomocnik sp p1)
   goals met: 0 of 2
2. (idz-jeden-pomocnik f sp p1)
   deleted: (kupiec f) (pomocnik sp p1)
   added: (kupiec sp) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
3. (idz-dwa-brak-pomocnik sp st p2)
   deleted: (kupiec sp) (pomocnik-z-kupcem p2)
   added: (kupiec st) (pomocnik st p2)
   goals met: 0 of 2
4. (idz-jeden-brak-pomocnika st so p1)
   deleted: (kupiec st) (pomocnik-z-kupcem p1)
   added: (kupiec f) (pomocnik so p1)
   goals met: 0 of 2
5. (idz-jeden-pomocnik f st p2)
   deleted: (kupiec f) (pomocnik st p2)
   added: (kupiec st) (pomocnik-z-kupcem p2)
   goals met: 0 of 2
6. (idz-jeden-pomocnik st so p1)
   deleted: (kupiec st) (pomocnik so p1)
   added: (kupiec so) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
7. (wez-tkanina n0)
   deleted: (ilosc tkanina n0)
   added: (ilosc tkanina n3) (wozek tkanina n1) (wozek tkanina n2) (wozek tkanina n3)
   goals met: 0 of 2
8. (idz-jeden-brak-pomocnika so st p1)
   deleted: (kupiec so) (pomocnik-z-kupcem p1)
   added: (kupiec f) (pomocnik st p1)
   goals met: 0 of 2
9. (idz-jeden-pomocnik f st p1)
   deleted: (kupiec f) (pomocnik st p1)
   added: (kupiec st) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
10. (idz-dwa-brak-pomocnik st sp p2)
   deleted: (kupiec st) (pomocnik-z-kupcem p2)
   added: (kupiec sp) (pomocnik sp p2)
   goals met: 0 of 2
11. (idz-jeden-brak-pomocnika sp t p1)
   deleted: (kupiec sp) (pomocnik-z-kupcem p1)
   added: (kupiec f) (pomocnik t p1)
   goals met: 0 of 2
12. (idz-jeden-pomocnik f sp p2)
   deleted: (kupiec f) (pomocnik sp p2)
   added: (kupiec sp) (pomocnik-z-kupcem p2)
   goals met: 0 of 2
13. (idz-jeden-pomocnik sp t p1)
   deleted: (kupiec sp) (pomocnik t p1)
   added: (kupiec t) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
14. (sprzedaj-tkanina n0)
   deleted: (wozek tkanina n1) (wozek tkanina n2) (wozek tkanina n3) (ilosc tkanina n3) (ilosc kawa n0)
   added: (ilosc tkanina n0) (ilosc kawa n1) (wozek kawa n1)
   goals met: 0 of 2
15. (idz-dwa-brak-pomocnik t cr p2)
   deleted: (kupiec t) (pomocnik-z-kupcem p2)
   added: (kupiec cr) (pomocnik cr p2)
   goals met: 0 of 2
16. (wez-czarny-rynek n0 n2 n0)
   deleted: (ilosc przyprawa n0) (ilosc owoce n2) (ilosc tkanina n0)
   added: (ilosc przyprawa n1) (wozek przyprawa n1) (ilosc owoce n3) (wozek owoce n3) (ilosc tkanina n1) (wozek tkanina n1)
   goals met: 0 of 2
17. (idz-dwa-brak-pomocnik cr t p1)
   deleted: (kupiec cr) (pomocnik-z-kupcem p1)
   added: (kupiec t) (pomocnik t p1)
   goals met: 0 of 2
18. (idz-do-f t f t cr)
   deleted: (kupiec t) (pomocnik t p1) (pomocnik cr p2)
   added: (kupiec f) (pomocnik-z-kupcem p1) (pomocnik-z-kupcem p2)
   goals met: 0 of 2
19. (idz-jeden-brak-pomocnika f st p1)
   deleted: (pomocnik-z-kupcem p1)
   added: (pomocnik st p1)
   goals met: 0 of 2
20. (idz-jeden-pomocnik f st p1)
   deleted: (kupiec f) (pomocnik st p1)
   added: (kupiec st) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
21. (idz-dwa-brak-pomocnik st sp p2)
   deleted: (kupiec st) (pomocnik-z-kupcem p2)
   added: (kupiec sp) (pomocnik sp p2)
   goals met: 0 of 2
22. (idz-dwa-brak-pomocnik sp st p1)
   deleted: (kupiec sp) (pomocnik-z-kupcem p1)
   added: (kupiec st) (pomocnik st p1)
   goals met: 0 of 2
23. (idz-dwa-pomocnik st sp p2)
   deleted: (kupiec st) (pomocnik sp p2)
   added: (kupiec sp) (pomocnik-z-kupcem p2)
   goals met: 0 of 2
24. (idz-jeden-brak-pomocnika sp t p2)
   deleted: (kupiec sp) (pomocnik-z-kupcem p2)
   added: (kupiec f) (pomocnik t p2)
   goals met: 0 of 2
25. (idz-jeden-pomocnik f st p1)
   deleted: (kupiec f) (pomocnik st p1)
   added: (kupiec st) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
26. (idz-dwa-brak-pomocnik st sp p1)
   deleted: (kupiec st) (pomocnik-z-kupcem p1)
   added: (kupiec sp) (pomocnik sp p1)
   goals met: 0 of 2
27. (idz-jeden-pomocnik sp t p2)
   deleted: (kupiec sp) (pomocnik t p2)
   added: (kupiec t) (pomocnik-z-kupcem p2)
   goals met: 0 of 2
28. (sprzedaj-owoce n1)
   deleted: (wozek owoce n1) (wozek owoce n2) (wozek owoce n3) (ilosc owoce n3) (ilosc kawa n1)
   added: (ilosc owoce n0) (ilosc kawa n2) (wozek kawa n2)
   goals met: 0 of 2
29. (idz-jeden-pomocnik t sp p1)
   deleted: (kupiec t) (pomocnik sp p1)
   added: (kupiec sp) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
30. (idz-dwa-brak-pomocnik sp st p1)
   deleted: (kupiec sp) (pomocnik-z-kupcem p1)
   added: (kupiec st) (pomocnik st p1)
   goals met: 0 of 2
31. (idz-jeden-brak-pomocnika st so p2)
   deleted: (kupiec st) (pomocnik-z-kupcem p2)
   added: (kupiec f) (pomocnik so p2)
   goals met: 0 of 2
32. (idz-jeden-pomocnik f st p1)
   deleted: (kupiec f) (pomocnik st p1)
   added: (kupiec st) (pomocnik-z-kupcem p1)
   goals met: 0 of 2
33. (idz-jeden-pomocnik st so p2)
   deleted: (kupiec st) (pomocnik so p2)
   added: (kupiec so) (pomocnik-z-kupcem p2)
   goals met: 0 of 2
34. (wez-owoc n0)
   deleted: (ilosc owoce n0)
   added: (ilosc owoce n3) (wozek owoce n1) (wozek owoce n2) (wozek owoce n3)
   goals met: 0 of 2
35. (idz-dwa-brak-pomocnik so ps p2)
   deleted: (kupiec so) (pomocnik-z-kupcem p2)
   added: (kupiec ps) (pomocnik ps p2)
   goals met: 1 of 2
36. (u-sultana)
   added: (wozek rubin n1)
   goals met: 2 of 2
